'''
Задача 32: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону
(т.е. не меньше заданного минимума и не больше заданного максимума)
[-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
  0  1  2  3   4   5  6  7   8  9  10  11 12  13 14  15  16 17   18 19 
диапазон 7-10
[1, 9, 13, 14, 19]
'''

def completion(minn: int, maxx: int, list_1: list[int]):
  list_res = []
  for i in range (len(list_1)):
    if list_1[i]>= minn and list_1[i] <= maxx:
        list_res.append(i)
  return list_res


list_1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

print('Введите минимальное число дипазона: ')
minn = input()
minn = int(minn)

print('Введите максимальное число дипазона: ')
maxx = input()
maxx = int(maxx)

print(completion(minn, maxx, list_1))